# -*- coding: utf-8 -*-
from time import sleep
def ox_print():
    print("第一次勇敢牛牛")
    sleep(3)
    print("勇敢牛牛，不怕困难？")
    sleep(3)
    print("第二次勇敢牛牛")
    sleep(3)
    print("勇敢牛牛，不怕困难。")
    sleep(3)
    print("第三次勇敢牛牛")
    sleep(3)
    print("（空气锤+平底锅）勇敢牛牛，不怕困难！")


oxLine = '''第一次勇敢牛牛：\n勇敢牛牛，不怕困难？\n第二次勇敢牛牛：\n勇敢牛牛，不怕困难。\n第三次勇敢牛牛：\n（空气锤+平底锅）勇敢牛牛，不怕困难！'''
oxDic = {"第一次": "勇敢牛牛，不怕困难？", "第二次": "勇敢牛牛，不怕困难。", "第三次": "勇敢牛牛，不怕困难！",
         1: "勇敢牛牛，不怕困难？", 2: "勇敢牛牛，不怕困难。", 3: "勇敢牛牛，不怕困难！"}
