# -*- coding: utf-8 -*-

class basic_data:
	def basic_data(self):
		common_data = {}

		#기본 색스타일을 기본스타일로 변경하는 것이다
		common_data["dic_check_colorstyle"] = {"v": "v", "b": "b", "s": "s", "dp": "dp", "lt": "lt", "sf": "sf", "d": "d", "dk": "dk", "p": "p", "ltg": "ltg", "g": "g", "dkg": "dkg",
		        "vivid": "v", "bright": "b", "strong": "s", "deep": "dp", "light": "lt", "soft": "sf", "dull": "d", "dark": "dk", "pale": "p", "lightgrayish": "ltg", "grayish": "g", "darkgrayish": "dkg",
		        "viv": "v", "bri": "b", "str": "s", "dee": "dp", "lig": "lt", "sof": "sf", "dul": "d", "dar": "dk", "pal": "p", "gra+": "ltg", "gra": "g", "gra-": "dkg",
		        "선명한": "v", "밝은": "b", "강한": "s", "짙은": "dp", "옅은": "lt", "부드러운": "sf", "둔한": "d", "어두운": "dk", "연한": "p", "밝은회색조": "ltg", "회색조": "g", "어두운회색조": "dkg"}

		#자주 사용하는 색의 이름을 기본색 이름으로 변경하는 것이다
		common_data["dic_check_colorname"] = {
			"빨": "red", "적": "red", "red": "red", "r": "red", "빨강": "red", 0: "red",
			"주": "ora", "yr": "ora", "yellowred": "ora", "o": "ora", "orange": "ora", "ora": "ora", "주황": "ora", 1: "ora", 30: "ora",
			"노": "yel", "y": "yel", "yellow": "yel", "yel": "yel", "노랑": "yel", 2: "yel", 60: "yel",
			"연": "gy", "gy": "gy", "greenyellow": "gy", "연두": "gy", "green-yellow": "gy", "yg": "gy", 3: "gy", 90: "gy",
			"초": "gre", "g": "gre", "green": "gre", "gre": "gre", "녹색": "gre", "초록": "gre", 4: "gre", 120: "gre",
			"연초록": "gc", "green-cyan": "gc", "cg": "gc", "gc": "gc", 5: "gc", 150: "gc",
			"옥": "cya", "옥색": "cya", "c": "cya", "cya": "cya", "cyan": "cya", 6: "cya", 180: "cya",
			"청록": "bc", "blue-cyan": "bc", "청": "bc", "cb": "bc", "bg": "bc", "bluegreen": "bc", "bc": "bc", 7: "bc", 210: "bc",
			"파": "blu", "b": "blu", "blue": "blu", "blu": "blu", "파랑": "blu", 8: "blu", 240: "blu",
			"남": "bm", "blue-magenta": "bm", "blue_magenta": "bm", "mb": "bm", "bm": "bm", "pb": "bm", "purpleblue": "bm", "violet": "bm", "vio": "bm", "남색": "bm", 9: "bm",270: "bm",
			"보": "mag", "magenta": "mag", "m": "mag", "보라": "mag", "mag": "mag", 10: "mag", 300: "mag",
			"자홍": "rm", "red-magenta": "rm", "rm": "rm", "red_magenta": "rm", "mr": "rm", "자주": "rm", 11: "rm", 330: "rm",
			"회": "gra", "회색": "gra", "gra": "gra", "gray": "gra", 12: "gra",
			"흰": "whi", "하양": "whi", "white": "whi", "whi": "whi", "흰색": "whi", 13: "whi",
			"검": "bla", "검정": "bla", "black": "bla", "흑": "bla", "bla": "bla", 14: "bla",
			}

		#컬러의 강도를 확인하는것
		common_data["dic_check_colorstrong"] = {
			55: "55", "55": "55", "ls": "55", "strong": "55", "s": "55", "강한": "55","기준": "55",
			0: "0", "0": "0", "l5": "0", "+++++": "0", "pale": "0", "p": "0", "pastel": "0", "파스텔": "0", "d5": "0",
			1: "1", "1": "1", "l4": "1", "++++": "1", "light grayish": "1", "ltg": "1", "d4": "1",
			2: "2", "2": "2", "l3": "2", "+++": "2", "light": "2", "lt": "2", "흐린": "2", "가벼운": "2", "d3": "2",
			3: "3", "3": "3", "l2": "3", "++": "3", "soft": "3", "sf": "3", "연한": "3", "d2": "3",
			4: "4", "4": "4", "l1": "4", "+": "4", "bright": "4", "b": "4", "밝은": "4", "d1": "4",
			5: "5", "5": "5", "l0": "5", "": "5", "vivid": "5", "v": "5", "선명한": "5", "basic": "5", "기본": "5", "d0": "5",
			6: "6", "6": "6", "l-1": "6", "-": "6", "deep": "6", "dp": "6", "진한": "6", "d-1": "6",
			7: "7", "7": "7", "l-2": "7", "--": "7", "dull": "7", "d": "7", "탁한": "7", "d-2": "7",
			8: "8", "8": "8", "l-3": "8", "---": "8", "dark": "8", "dk": "8", "어두운": "8", "d-3": "8",
			9: "9", "9": "9", "l-4": "9", "----": "9", "grayish": "9", "g": "9", "회색빛": "9",  "잿빛": "9", "d-4": "9",
			10: "10", "10": "10", "l-5": "10", "-----": "10", "dark grayish": "10", "dkg": "10", "어두운 회색": "10",  "d-5": "10",
			}

		common_data["dic_colorname_colornum_forexcel"] = {
			"검정색": 1,	"흰색": 2, "빨강색": 3, "파랑색": 5, "노랑색": 6,
			"핑크색": 7, "오렌지": 46, "보라색": 13, "청록색": 14, "옅은노랑": 19,
			"옅은하늘": 20, "매실색": 18, "밝은하늘": 8, "연두색": 4, "회색20": 15,
			"회색40": 48, "회색60": 16, "회색80": 56, "진한적색": 9, "진한녹색": 10,
			"진한청색": 11, "진한황색": 12, "진한보라": 21, "진한하늘": 33, "진한산호색": 49,
			"담자색": 17, "토황색": 45, "취람색": 35, "송화색": 36, "두록색": 40,
			"주색": 22, "청현색": 23, "회보라색": 24, "밝은벽청색": 37, "선홍색": 38, "치색": 47,
			"black": 1, "white": 2, "red": 3, "blue": 5, "yellow": 6,
			"pink": 7, "orange": 46, "purple": 13, "green": 14, "gray": 15,
		}

		common_data["dic_colornum_colorname_forexcel"] = {
			1:"검정색",	2:"흰색", 3:"빨강색", 5: "파랑색", 6:"노랑색",
			7: "핑크색", 46:"오렌지", 13:"보라색", 14:"청록색", 19:"옅은노랑",
			20:"옅은하늘", 18: "매실색", 8:"밝은하늘", 4:"연두색", 15: "회색20",
			48:"회색40", 16:"회색60", 56:"회색80", 9:"진한적색", 10:"진한녹색",
			11:"진한청색", 12:"진한황색", 21:"진한보라", 33:"진한하늘", 49:"진한산호색",
			17:"담자색", 45:"토황색", 35:"취람색", 36:"송화색", 40:"두록색",
			22:"주색", 23:"청현색", 24:"회보라색", 37:"밝은벽청색", 38:"선홍색", 47:"치색",
		}

		common_data["dic_check_colormode"] ={1: "단색조합", "단색조합": 1,"강력한 대기효과와 넓은공간감": 1,
				              2: "등간격 3색 조화", "등간격 3색 조화": 2, "활동적인 인상과 이미지": 2,
				              3: "보색", "보색": 3, "강력한비교": 3,
				              4: "인접색",  "인접색": 4,"비슷한색 찾기": 4,
				              5: "근접보색조합", "근접보색조합": 5,"보색의 강한 인상이 부담스러울때 보색의 근처에있는 색": 5,
				              6: "고명도배색", "고명도배색": 6,
				              7: "고명도배색+약간더 부드러운 이미지", "고명도배색+약간더 부드러운 이미지":7,
				              8: "중명도배색",  "중명도배색":8,
							  9: "중명도배색+약간더 부드러운 이미지", "중명도배색+약간더 부드러운 이미지":9,
							  10: "저중명도배색",  "저중명도배색": 10,
							  11: "저명도배색+약간더 어두운 이미지", "저명도배색+약간더 어두운 이미지": 11,
							  12: "명도차가 큰 배색",  "명도차가 큰 배색": 12,
							  13: "명도차가 큰 배색 + 근접보색", "명도차가 큰 배색 + 근접보색": 13,
							  14: "고채도 배색",  "고채도 배색": 14,
							  15: "채도차가 큰 배색", "채도차가 큰 배색": 15,
							  16: "저채도 배색", "저채도 배색": 16,"차분하고 무거운 이미지": 16,
				              }

		common_data["dic_color_index"] = {"red":0, "ora":1, "yel":2, "yg":3, "gre":4, "gc":5, "cya":6, "cb":7, "blu":8, "bm":9, "mag":10, "mr":11, "gra":12, "whi":13, "bla":14}


		common_data["dic_num_sstep"] = {"1": [10], "2": [20], "3": [30], "4": [40],"5": [50], "6": [60], "7": [70], "8": [80], "9": [90], }

		common_data["dic_num_lstep"] = {"1": [10], "2": [20], "3": [30], "4": [40],"5": [50], "6": [60], "7": [70], "8": [80], "9": [90], }

		common_data["dic_linethick_num_forexcel"] = {"hairline": 1, "basic": -4138, "thick": 4, "thin": 2,"t-2": 1, "t0": -4138, "t1": 4, "t-1": 2, "매우가는선": 1, "일반": -4138, "굵은선": 4, "가는선": 2,}

		common_data["dic_lineposition_num_forexcel"] = {"/": 6, "\\": 5, "left": 7, "top": 8, "bottom": 9, "right": 10, "inside-h": 11, "inside-v": 12, "대각선오른쪽": 6, "대각선왼쪽": 5, "왼쪽": 7, "위쪽": 8, "아래쪽": 9, "오른쪽": 10, "안쪽세로": 11, "안쪽가로": 12, }

		common_data["dic_linestyle_num_forexcel"] = {"basic": 1, "-": -4115, "-.": 4, "-..": 5, ".": -4118, "=": -4119, "no": -4142, "/.": 13, "실선": 1, "점선": 2, "가는점선": 1, "굵은실선": 6, }

		common_data["dic_colorname_hnum"] = {"red": 0, "ora": 30, "yel": 60, "gy": 90, "gre": 120, "gc": 150 , "cya": 180, "bc": 210, "blu": 240, "bm": 270, "mag": 300, "rm": 330, "gra": 0, "whi": 0, "bla": 0, }

		common_data["dic_num_slstep_small"] = {"1": [0, 12], "2": [0, 9], "3": [0, 6], "4": [0, 3], "5": [0, 0], "6": [0, -3], "7": [0, -6], "8": [0, -9], "9": [0, -12], "0": [0, -14],}
		common_data["dic_num_slstep"] = {"1": [100, 80], "2": [100, 77], "3": [100, 68], "4": [100, 59], "5": [100, 50], "6": [90, 41], "7": [80, 32], "8": [70, 23], "9": [60, 14] }


		common_data["list_colorname_pccs"] = ["v", "b", "s", "dp", "lt", "sf", "d", "dk", "p", "ltg", "g", "dkg"]

		common_data["list_colorname_kor"] = ["빨강", "주황", "노랑", "연두", "초록", "연초록", "옥색", "청록", "파랑", "남색", "보라", "자홍", "회색", "흰색", "검정"]
		common_data["list_colorname_eng"] = ["red", "ora", "yel", "gy", "gre", "gc", "cya", "bc", "blu", "bm", "mag", "rm", "gra", "whi", "bla"]
		common_data["list_colorname_eng_short"] = ["r", "o", "y", "gy", "g", "gc", "c", "bc", "b", "bm", "m", "rm", "g", "w", "bl"]

		common_data["list_colorstyle_eng"] = ["vivid", "bright", "strong", "deep", "light", "soft", "dull", "dark", "pale", "lightgrayish", "grayish", "darkgrayish"]
		common_data["list_colorstyle_kor"] = ["파스텔", "연한", "밝은", "흐린", "선명한", "기본", "탁한", "진한", "어두운", "회색", "검은", "검정"]
		common_data["list_colorstyle_eng"] = ["white", "pale", "light", "soft", "vivid", "dull", "deep", "dark", "black", "gray"]

		common_data["list_colorstyle_slno"] = [[90, 50], [80, 30], [80, 50], [80, 70], [50, 20], [50, 40], [50, 60], [50, 80], [20, 20], [20, 40], [20, 60], [20, 80]]

		common_data["list_colormode_kor"]= ["단색조합", "등간격 3색 조화", "보색", "인접색", "근접보색조합",
					           "고명도배색", "고명도배색+약간더 부드러운 이미지",
					           "중명도배색", "중명도배색+약간더 부드러운 이미지", "저중명도배색", "저명도배색+약간더 어두운 이미지",
							   "명도차가 큰 배색", "명도차가 큰 배색 + 근접보색",
							   "고채도 배색", "채도차가 큰 배색", "저채도 배색",]

		common_data["list_56rgb_forexcel"] = [[0,0,0], [255,255,255], [255,0,0], [0,255,0], [0,0,255], [255,255,0],
										[255,0,255], [0,255,255], [128,0,0], [0,128,0], [0,0,128], [128,128,0],
										[128,0,128], [0,128,128], [192,192,192], [128,128,128], [153,153,255],
										[153,51,102], [255,255,204], [204,255,255], [102,0,102], [255,128,128],
										[0,102,204], [204,204,255], [0,0,128], [255,0,255], [255,255,0],
										[0,255,255], [128,0,128], [128,0,0], [0,128,128], [0,0,255],
										[0,204,255], [204,255,255], [204,255,204], [255,255,153], [153,204,255],
										[255,153,204], [204,153,255], [255,204,153], [51,102,255], [51,204,204],
										[153,204,0], [255,204,0], [255,153,0], [255,102,0], [102,102,153],
										[150,150,150], [0,51,102], [51,153,102], [0,51,0], [51,51,0],
										[153,51,0], [153,51,102], [51,51,153], [51,51,51]]

		common_data["list_46rgb_forexcel"] = [[255, 0, 0], [0, 255, 0], [0, 0, 255], [255, 255, 0], [255, 0, 255],
					 [0, 255, 255], [153, 51, 102], [255, 255, 204], [204, 255, 255], [102, 0, 102],
					 [255, 128, 128], [0, 102, 204], [204, 204, 255], [0, 204, 255], [204, 255, 204],
					 [255, 255, 153], [153, 204, 255], [255, 153, 204], [204, 153, 255], [255, 204, 153],
					 [51, 102, 255], [51, 204, 204], [153, 204, 0], [255, 204, 0], [255, 153, 0],
					 [255, 102, 0], [102, 102, 153], [150, 150, 150], [0, 51, 102], [51, 153, 102],
					 [0, 51, 0], [51, 51, 0], [153, 51, 0], [51, 51, 153], [51, 51, 51],
					 [128, 0, 0], [0, 128, 0], [0, 0, 128], [128, 128, 0], [128, 0, 128],
					 [0, 128, 128], [192, 192, 192], [128, 128, 128], [153, 153, 255], [0, 0, 0],
					 [255, 255, 255]]

		common_data["list_basic_12rgb"] = [[255, 0, 0],[255, 128, 0],[255, 255, 0],[128, 255, 0],
										[0, 255, 0],[0, 255, 128],[0, 255, 255],[0, 128, 255],
										[0, 0, 255],[128, 0, 255],[255, 0, 255],[255, 0, 128],]

		common_data["list_basic_12hsl"] = [[0, 100, 50], [30, 100, 50], [60, 100, 50], [90, 100, 50], [120, 100, 50],
						                 [150, 100, 50], [180, 100, 50], [210, 100, 50], [240, 100, 50], [270, 100, 50],
						                 [300, 100, 50], [330, 100, 50]]

		common_data["list_basic_12h"] = [0, 30, 60, 90, 120, 150, 180, 210, 240, 270, 300, 330]

		common_data["list_basic_10sl"] = [[100, 0], [90, 10], [80, 20], [70, 30],  [60, 40], [50, 50], [40, 60], [30, 70], [10, 80], [10, 90], [0, 100]]

		common_data["list_basic_11sl"] = [[100, 0], [100, 10], [100, 20], [100, 30], [100, 40], [100, 50], [100, 60], [100, 70], [100, 80],  [100, 90], [100, 100]]

		common_data["list_basic_12colorstyle"] = [[90, 50], [80, 30], [80, 50], [80, 70], [50, 20], [50, 40], [50, 60], [50, 80], [20, 20], [20, 40], [20, 60], [20, 80]]

		common_data["list_johannes_hsl"] = [
			[[0, 100, 0], [0, 100, 10], [0, 100, 20], [0, 100, 30], [0, 100, 40], [0, 100, 50], [0, 100, 60], [0, 100, 70],
			 [0, 100, 80], [0, 100, 90], [0, 100, 100]],
			[[30, 100, 0], [30, 100, 10], [30, 100, 20], [30, 100, 30], [30, 100, 40], [30, 100, 50], [30, 100, 60],
			 [30, 100, 70], [30, 100, 80], [30, 100, 90], [30, 100, 100]],
			[[60, 100, 0], [60, 100, 10], [60, 100, 20], [60, 100, 30], [60, 100, 40], [60, 100, 50], [60, 100, 60],
			 [60, 100, 70], [60, 100, 80], [60, 100, 90], [60, 100, 100]],
			[[90, 100, 0], [90, 100, 10], [90, 100, 20], [90, 100, 30], [90, 100, 40], [90, 100, 50], [90, 100, 60],
			 [90, 100, 70], [90, 100, 80], [90, 100, 90], [90, 100, 100]],
			[[120, 100, 0], [120, 100, 10], [120, 100, 20], [120, 100, 30], [120, 100, 40], [120, 100, 50], [120, 100, 60],
			 [120, 100, 70], [120, 100, 80], [120, 100, 90], [120, 100, 100]],
			[[150, 100, 0], [150, 100, 10], [150, 100, 20], [150, 100, 30], [150, 100, 40], [150, 100, 50], [150, 100, 60],
			 [150, 100, 70], [150, 100, 80], [150, 100, 90], [150, 100, 100]],
			[[180, 100, 0], [180, 100, 10], [180, 100, 20], [180, 100, 30], [180, 100, 40], [180, 100, 50], [180, 100, 60],
			 [180, 100, 70], [180, 100, 80], [180, 100, 90], [180, 100, 100]],
			[[210, 100, 0], [210, 100, 10], [210, 100, 20], [210, 100, 30], [210, 100, 40], [210, 100, 50], [210, 100, 60],
			 [210, 100, 70], [210, 100, 80], [210, 100, 90], [210, 100, 100]],
			[[240, 100, 0], [240, 100, 10], [240, 100, 20], [240, 100, 30], [240, 100, 40], [240, 100, 50], [240, 100, 60],
			 [240, 100, 70], [240, 100, 80], [240, 100, 90], [240, 100, 100]],
			[[270, 100, 0], [270, 100, 10], [270, 100, 20], [270, 100, 30], [270, 100, 40], [270, 100, 50], [270, 100, 60],
			 [270, 100, 70], [270, 100, 80], [270, 100, 90], [270, 100, 100]],
			[[300, 100, 0], [300, 100, 10], [300, 100, 20], [300, 100, 30], [300, 100, 40], [300, 100, 50], [300, 100, 60],
			 [300, 100, 70], [300, 100, 80], [300, 100, 90], [300, 100, 100]],
			[[330, 100, 0], [330, 100, 10], [330, 100, 20], [330, 100, 30], [330, 100, 40], [330, 100, 50], [330, 100, 60],
			 [330, 100, 70], [330, 100, 80], [330, 100, 90], [330, 100, 100]]]

		common_data["list_faber_sl"] = [[[100, 0], [100, 50], [0, 0]],
					[[0, 0], [0, 75], [0, 100]],
					[[100, 0], [25, 75], [0, 100]],
					[[25, 0], [10, 50], [0, 75]],
					[[100, 0], [0, 0], [0, 100]],
					[[25, 0], [10, 50], [0, 75], [25, 75]], ]

		common_data["list_알파벳"] = "abcdefghijklmnopqrstuvwxyz"
		common_data["list_자음"] = "ㄱㄴㄷㄹㅁㅂㅅㅇㅈㅊㅋㅌㅍㅎ"
		common_data["list_모음"] ="ㅏㅑㅓㅕㅗㅛㅜㅠㅡㅣ"
		common_data["list_가나다"] = "가나다라마바사아자차카타파하"
		common_data["list_숫자"]= "1234567890"
		common_data["list_그리스문자"]= "αβγδεζήθικλμνξόπρΣτ"
		common_data["list_로마숫자"] = "ⅠⅡⅢⅣⅤⅥⅦⅧⅨⅩ"
		common_data["list_원ㄱ"] = "㉠㉡㉢㉣㉤㉥㉦㉧㉨㉩㉪㉫㉬㉭"
		common_data["list_원가"] = "㉮㉯㉰㉱㉲㉳㉴㉵㉶㉷㉸㉹㉺㉻"
		common_data["list_원a"] = "ⒶⒷⒸⒹⒺⒻⒼⒽⒾⒿⓀⓁⓂⓃⓄⓅⓆⓇⓈⓉⓊⓋⓌⓍⓎⓏ"
		common_data["list_원1"] ="⓪①②③④⑤⑥⑦⑧⑨⑩⑪⑫⑬⑭⑮⑯⑰⑱⑲⑳㉑㉒㉓㉔㉕㉖㉗㉘㉙㉚㉛㉜㉝㉞㉟㊱㊲㊳㊴㊵㊶㊷㊸㊹㊺㊻㊼㊽㊾㊿"
		common_data["list_서수"] =['1ST', '2ND', '3RD', '4TH', '5TH', '6TH', '7TH', '8TH', '9TH', '10TH', '11TH', '12TH', '13TH', '14TH', '15TH', '16TH', '17TH', '18TH', '19TH', '20TH', '21ST', '22ND', '23RD', '24TH', '25TH', '26TH', '27TH', '28TH', '29TH', '30TH', '31ST']

		common_data["list_month_eng_short"] = ['JAN', 'FEB', 'MAR', 'APR', 'MAY', 'JUN', 'JUL', 'AUG', 'SEP', 'OCT', 'NOV', 'DEC']
		common_data["list_month_eng"] = ['JANUARY', 'FEBRUARY', 'MARCH', 'APRIL', 'MAY', 'JUNE', 'JULY', 'AUGUST', 'SEPTEMBER', 'OCTOBER','NOVEMBER', 'DECEMBER']
		common_data["list_getdigit"] = ['one', 'two', 'three', 'four', 'five', 'six', 'seven', 'eight', 'nine']
		common_data["list_num_eng_00digit"] = ['twenty', 'thirty', 'forty', 'fifty', 'sixty', 'seventy', 'eighty', 'ninety']
		common_data["list_num_eng_10"] = ['ten', 'eleven', 'twelve', 'thirteen', 'fourteen', 'fifteen', 'sixteen', 'eighteen', 'nineteen']
		common_data["list_num_eng_unit_1000"] = ['thousand', 'million', 'billion', 'trillion']
		common_data["list_currency_eng_last"] = ['no', 'one', 'dollars']
		common_data["list_num_last_cent"] = ['only', 'and one cent', 'and', 'cents']

		return common_data